docs/inclass08A.org
#+TITLE: SWE 619 In Class Exercise Number 8A

#+HTML_HEAD: <link rel="stylesheet" href="https://nguyenthanhvuh.github.io/files/org.css">
#+HTML_HEAD: <link rel="stylesheet" href="https://nguyenthanhvuh.github.io/files/org-orig.css">

* Instructions

  Given the following variable declarations, independently consider the given 6 sequences of Java instructions.
  #+begin_src java

    String           string = "bat";
    Integer          x = 7;
    Object[]         objects;
    List             rawList;
    List < Object >  objectList;
    List < String >  stringList;

  #+end_src

  Identify any code that results in a compiler error or warning.
  Identify any code that raises a runtime exception.
  Once a compiler error is noted, you do not need to analyze the sequence further.

  1.
     #+begin_src java
       objects = new String[1]; 
       objects[0] = string;     
       objects[0] = x;        
     #+end_src

  1.
     #+begin_src java
       objects = new Object[1];
       objects[0] = string;   
       objects[0] = x;     
     #+end_src

  1.
     #+begin_src java
       stringList = new ArrayList < String >();
       stringList.add(string) ;
     #+end_src

  1.
     #+begin_src java
       objectList = new ArrayList < String >();
       objectList.add(string) ;
     #+end_src

  1.
     #+begin_src java
       objectList = new ArrayList < Object >(); 
       objectList.add(string) ;      
       objectList.add(x) ;        
     #+end_src

  6.
     #+begin_src java
       rawList = new ArrayList();
       rawList.add(string) ;    
       rawList.add(x) ;       
     #+end_src



* Links
  - [[./index.html][Syllabus]]
  - [[./schedule.html][Schedule]]

