docs/inclass08A.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-07-10 Sat 21:19 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>SWE 619 In Class Exercise Number 8A</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="ThanhVu (Vu) Nguyen" />
<link rel="stylesheet" href="https://nguyenthanhvuh.github.io/files/org.css">
<link rel="stylesheet" href="https://nguyenthanhvuh.github.io/files/org-orig.css">
</head>
<body>
<div id="content">
<h1 class="title">SWE 619 In Class Exercise Number 8A</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org1f1e414">1. Instructions</a></li>
<li><a href="#org3b4bd48">2. Links</a></li>
</ul>
</div>
</div>

<div id="outline-container-org1f1e414" class="outline-2">
<h2 id="org1f1e414"><span class="section-number-2">1</span> Instructions</h2>
<div class="outline-text-2" id="text-1">
<p>
Given the following variable declarations, independently consider the given 6 sequences of Java instructions.
</p>
<div class="org-src-container">
<pre class="src src-java">
<span style="color: #b58900;">String</span>           <span style="color: #6c71c4;">string</span> = <span style="color: #2aa198;">"bat"</span>;
<span style="color: #b58900;">Integer</span>          <span style="color: #6c71c4;">x</span> = 7;
<span style="color: #b58900;">Object</span>[]         <span style="color: #6c71c4;">objects</span>;
<span style="color: #b58900;">List</span>             <span style="color: #6c71c4;">rawList</span>;
<span style="color: #b58900;">List</span> &lt; <span style="color: #b58900;">Object</span> &gt;  <span style="color: #6c71c4;">objectList</span>;
<span style="color: #b58900;">List</span> &lt; <span style="color: #b58900;">String</span> &gt;  <span style="color: #6c71c4;">stringList</span>;

</pre>
</div>

<p>
Identify any code that results in a compiler error or warning.
Identify any code that raises a runtime exception.
Once a compiler error is noted, you do not need to analyze the sequence further.
</p>

<ol class="org-ol">
<li><div class="org-src-container">
<pre class="src src-java">objects = <span style="color: #859900; font-weight: bold;">new</span> <span style="color: #b58900;">String</span>[1]; 
objects[0] = string;     
objects[0] = x;        
</pre>
</div></li>

<li><div class="org-src-container">
<pre class="src src-java">objects = <span style="color: #859900; font-weight: bold;">new</span> <span style="color: #b58900;">Object</span>[1];
objects[0] = string;   
objects[0] = x;     
</pre>
</div></li>

<li><div class="org-src-container">
<pre class="src src-java">stringList = <span style="color: #859900; font-weight: bold;">new</span> <span style="color: #b58900;">ArrayList</span> &lt; <span style="color: #b58900;">String</span> &gt;();
stringList.add(string) ;
</pre>
</div></li>

<li><div class="org-src-container">
<pre class="src src-java">objectList = <span style="color: #859900; font-weight: bold;">new</span> <span style="color: #b58900;">ArrayList</span> &lt; <span style="color: #b58900;">String</span> &gt;();
objectList.add(string) ;
</pre>
</div></li>

<li><div class="org-src-container">
<pre class="src src-java">objectList = <span style="color: #859900; font-weight: bold;">new</span> <span style="color: #b58900;">ArrayList</span> &lt; <span style="color: #b58900;">Object</span> &gt;(); 
objectList.add(string) ;      
objectList.add(x) ;        
</pre>
</div></li>

<li><div class="org-src-container">
<pre class="src src-java">rawList = <span style="color: #859900; font-weight: bold;">new</span> <span style="color: #b58900;">ArrayList</span>();
rawList.add(string) ;    
rawList.add(x) ;       
</pre>
</div></li>
</ol>
</div>
</div>



<div id="outline-container-org3b4bd48" class="outline-2">
<h2 id="org3b4bd48"><span class="section-number-2">2</span> Links</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li><a href="./index.html">Syllabus</a></li>
<li><a href="./schedule.html">Schedule</a></li>
</ul>
</div>
</div>
</div>
</body>
</html>
